---
kind: property
id: P:Autodesk.Revit.DB.IViewSheetSet.Views
source: html/48d5707a-ef8b-3609-a573-c393026bc812.htm
---
# Autodesk.Revit.DB.IViewSheetSet.Views Property

The views.

## Syntax (C#)
```csharp
ViewSet Views { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when the input views is Nothing nullptr a null reference ( Nothing in Visual Basic) .
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the set operation failed due to invalid view which cannot be printed.